Repository: diemonator/diemonator.github.io
Catalog: lib/core/localization/app_*.arb
Languages: bg

# appTitle
source: Portfolio E.K.
bg: Портфолио Е.К.

source: Home
bg: Начало

source: Portfolio
bg: Портфолио

source: Profile
bg: Профил

source: Contacts
bg: Контакти

# footer
source: Copyright © 2025 Emil Karamihov. All rights reserved.
bg: Авторско право © 2025 Емил Карамихов. Всички права запазени.

source: Dark mode
bg: Тъмна тема

# optimisedMobile
source: Optimised for mobile
bg: Мобилен изглед

# underConstruction
source: This page is under construction
bg: Тази страница е в разработка

# personalStatement
source: I'm a software engineer driven by a passion for development and continuous learning.
bg: Аз съм софтуерен инженер, воден от страст към разработката и непрекъснатото учене.

# codingPhilosophy
source: I enjoy crafting clean, efficient code, blending passion with creativity and fun.
bg: Обичам да създавам чист, ефективен код, съчетавайки страст с креативност и забавление.

# smallIntro
source: Hi, my name is Emil Karamihov and I'm a software engineer.
bg: Моето име е Емил Карамихов и аз съм софтуерен инженер.

# techStack
source: My technology stack
bg: Моят технологичен стек

# programmingLanguageStack
source: My programming language stack
bg: Моят програмирански езиков стек

source: Personal Profile
bg: Личен профил

# personalDescription
source: I graduated with a Bachelor's in ICT & Software Engineering at Fontys University of Applied Sciences. I am a quick learner, hardworking, flexible, friendly, and social. As a professional software developer with good communication skills, I am easy to work with. My skills allow me to work both individually and within a team. Additionally, I have an appetite for learning new technologies and programming languages since every technology has its specific use and place. Professional software engineers mustn’t only write quality code and have an in-depth understanding of a technology. A true professional is a person who coaches, provides assistance, and leads by example, not by demand. A good team leader helps team members to become leaders themselves.
bg: Завърших бакалавърска степен по ИКТ и Софтуерно инженерство в Университета по приложни науки Fontys. Бързо уча, трудолюбив съм, гъвкав, дружелюбен и социален. Като професионален софтуерен разработчик с добри комуникационни умения, лесно се работи с мен. Моите умения ми позволяват да работя както индивидуално, така и в екип. Освен това имам желание да уча нови технологии и програмни езици, тъй като всяка технология има своето специфично приложение и място. Професионалните софтуерни инженери не трябва само да пишат качествен код и да имат задълбочено разбиране на технологията. Истинският професионалист е човек, който обучава, предоставя помощ и води с пример, а не с изискване. Добър ръководител на екип помага на членовете на екипа да станат лидери сами.

source: Work Experience
bg: Професионален опит

# kaizenTime
source: March 2023 – Present
bg: Март 2023 – Настояще

# kaizenPosition
source: Backend software engineer working on microservices.
bg: Backend софтуерен инженер, работещ по микросервизи.

# kaizenTask1
source: Complex microservice architecture understanding
bg: Разбиране на сложна микросервисна архитектура

# kaizenTask2
source: Worked on creating microservice "adapters" (casino games integrations)
bg: Работа по създаване на микросервисни "адаптери" (интеграции на казино игри)

# kaizenTask3
source: Created an internal tool to streamline internal process
bg: Създаване на вътрешен инструмент за оптимизиране на вътрешния процес

# kaizenTask4
source: Mentoring developers and teaching programming to future automation QAs
bg: Менторство на разработчици и обучение на бъдещи QA автоматизатори

# kaizenTask5
source: Writing and maintaining quality code
bg: Писане и поддържане на качествен код

# kaizenTask6
source: Understanding architectural needs based on microservice accomplishment goal
bg: Разбиране на архитектурните нужди според целта на микросервиза

# kaizenTask7
source: Writing performant and scalable code
bg: Писане на производителен и мащабируем код

# kaizenTask8
source: Unit, Integration, Component & E2E testing
bg: Unit, интеграционно, компонентно и E2E тестване

# appolicaTime
source: September 2021 – October 2023
bg: Септември 2021 – Октомври 2023

# appolicaPosition
source: Flutter team lead, Mobile software engineer & tech expert
bg: Flutter ръководител на екип, мобилен софтуерен инженер и технически експерт

# appolicaTask1
source: Worked on multiple Flutter projects and conducted interviews for Flutter developers
bg: Работа по множество Flutter проекти и провеждане на интервюта за Flutter разработчици

# appolicaTask2
source: Improved internal processes such as adapting the available native pipeline to accommodate a Flutter app
bg: Подобряване на вътрешни процеси като адаптиране на наличния нативен процес към Flutter приложение

# appolicaTask3
source: Created Flutter template projects - standard and modular
bg: Създаване на Flutter шаблонни проекти - стандартни и модулни

# appolicaTask4
source: Team management, training, and leading company initiatives
bg: Управление на екип, обучение и водене на инициативи в компанията

# appolicaTask5
source: Providing technical expertise for Flutter projects and participating in sales phases
bg: Предоставяне на техническа експертиза за Flutter проекти и участие в продажбени фази

# embeddedFitnessTime
source: September 2021 – October 2023
bg: Септември 2021 – Октомври 2023

# embeddedFitnessPosition
source: FullStack software developer
bg: FullStack софтуерен разработчик

# embeddedFitnessTask1
source: Learned Flutter & Dart, NodeJS with SocketIO, and ReactJS
bg: Изучаване на Flutter & Dart, NodeJS със SocketIO и ReactJS

# embeddedFitnessTask2
source: Applied MVVM architecture and software design patterns
bg: Прилагане на MVVM архитектура и софтуерни дизайнерски модели

# embeddedFitnessTask3
source: Project management, user testing, communication, and presenting skills
bg: Управление на проекти, тестване с потребители, комуникация и презентационни умения

# vanderlandeTime
source: February 2020 – March 2020
bg: Февруари 2020 – Март 2020

# vanderlandePosition
source: Full-time software developer intern, R&D department
bg: Стажант софтуерен разработчик, отдел R&D

# vanderlandeTasks1
source: Worked on WPF forms applications with MVVM software architecture
bg: Работа върху WPF форми с MVVM софтуерна архитектура

# vanderlandeTasks2
source: Project management, communication, and presenting skills
bg: Управление на проекти, комуникация и презентационни умения

# authoreTime
source: February 2019 – June 2019
bg: Февруари 2019 – Юни 2019

# authorePosition
source: Full-time software developer intern
bg: Стажант софтуерен разработчик

# authoreTasks1
source: Developed an internal code documenting system
bg: Разработване на вътрешна система за документация на код

# authoreTasks2
source: Worked with APIs, XMLs, and .NET Compiler
bg: Работа с API, XML и .NET Compiler

# authoreTasks3
source: Extended knowledge in design patterns and multi-threading
bg: Разширени познания в дизайн шаблони и многопоточност

source: Education
bg: Образование

# fontysUniversity
source: Fontys University of Applied Sciences
bg: Университет по приложни науки - Fontys

# fontysTime
source: August 2016 – July 2021
bg: Август 2016 – Юли 2021

# fontysPosition
source: Bachelor of Science, ICT & Software Development in English
bg: Бакалавър на науките, ИКТ и Софтуерно инженерство на английски

# fontysDetails1
source: Mobile development: Finished Android and iOS specializations covering native development, UX/UI, and mobile lifecycle.
bg: Мобилно разработване: Завършени Android и iOS специализации, обхващащи нативно разработване, UX/UI и мобилен жизнен цикъл.

# fontysDetails2
source: Languages: C#, Java, Kotlin, Swift, C/C++, JS, HTML & CSS, PHP, SQL, PL*SQL
bg: Езици: C#, Java, Kotlin, Swift, C/C++, JS, HTML & CSS, PHP, SQL, PL*SQL

# fontysDetails3
source: Technologies: .NET Framework, WCF, WPF, Unity, Laravel, AngularJS, and more.
bg: Технологии: .NET Framework, WCF, WPF, Unity, Laravel, AngularJS и други.

# ntbg
source: National Trade & Banking High School (NTBG)
bg: Национална търговско-банкова гимназия (НТБГ)

# ntbgTime
source: September 2011 – May 2016
bg: Септември 2011 – Май 2016

# ntbgPosition
source: Specialty and acquired qualification - Operational Accountant
bg: Специалност и придобита квалификация - Оперативен счетоводител

# address
source: Sofia, Bulgaria
bg: София, България

# addressEindhoven
source: Eindhoven, The Netherlands
bg: Айндховен, Нидерландия

# addressVeghel
source: Veghel, The Netherlands
bg: Вегхел, Нидерландия

# addressHelmond
source: Helmond, The Netherlands
bg: Хелмонд, Нидерландия

# follow
source: Follow me on social media
bg: Последвайте ме в социалните мрежи

# getInTouch
source: Want to get in touch?
bg: Искате да се свържете?

# sayHello
source: Or just say hello.
bg: Или да кажете здрасти.

source: Download mobile app
bg: Изтеглете мобилното приложение
